{"arxiv_id": "2401.01234v1", "title": "Mixture cure semiparametric additive hazard models under partly interval censoring -- a penalized likelihood approach", "authors": ["Jinqing Li", "Jun Ma"], "published": "2024-01-02T15:02:42+00:00", "updated": "2024-01-02T15:02:42+00:00", "summary": "Survival analysis can sometimes involve individuals who will not experience the event of interest, forming what is known as the cured group. Identifying such individuals is not always possible beforehand, as they provide only right-censored data. Ignoring the presence of the cured group can introduce bias in the final model. This paper presents a method for estimating a semiparametric additive hazards model that accounts for the cured fraction. Unlike regression coefficients in a hazard ratio model, those in an additive hazard model measure hazard differences. The proposed method uses a primal-dual interior point algorithm to obtain constrained maximum penalized likelihood estimates of the model parameters, including the regression coefficients and the baseline hazard, subject to certain non-negativity constraints.", "primary_category": "stat.ME", "categories": ["stat.ME"], "doi": null, "pdf_url": "https://arxiv.org/pdf/2401.01234v1", "entry_id": "http://arxiv.org/abs/2401.01234v1"}
{"arxiv_id": "2311.12345v1", "title": "Stable Diffusion For Aerial Object Detection", "authors": ["Yanan Jian", "Fuxun Yu", "Simranjit Singh", "Dimitrios Stamoulis"], "published": "2023-11-21T04:38:21+00:00", "updated": "2023-11-21T04:38:21+00:00", "summary": "Aerial object detection is a challenging task, in which one major obstacle lies in the limitations of large-scale data collection and the long-tail distribution of certain classes. Synthetic data offers a promising solution, especially with recent advances in diffusion-based methods like stable diffusion (SD). However, the direct application of diffusion methods to aerial domains poses unique challenges: stable diffusion's optimization for rich ground-level semantics doesn't align with the sparse nature of aerial objects, and the extraction of post-synthesis object coordinates remains problematic. To address these challenges, we introduce a synthetic data augmentation framework tailored for aerial images. It encompasses sparse-to-dense region of interest (ROI) extraction to bridge the semantic gap, fine-tuning the diffusion model with low-rank adaptation (LORA) to circumvent exhaustive retraining, and finally, a Copy-Paste method to compose synthesized objects with backgrounds, providing a nuanced approach to aerial object detection through synthetic data.", "primary_category": "cs.CV", "categories": ["cs.CV", "cs.AI", "cs.LG"], "doi": null, "pdf_url": "https://arxiv.org/pdf/2311.12345v1", "entry_id": "http://arxiv.org/abs/2311.12345v1"}
