{"arxiv_id": "2401.01234v1", "title": "Mixture cure semiparametric additive hazard models under partly interval censoring -- a penalized likelihood approach", "authors": ["Jinqing Li", "Jun Ma"], "published": "2024-01-02T15:02:42+00:00", "updated": "2024-01-02T15:02:42+00:00", "summary": "Survival analysis can sometimes involve individuals who will not experience the event of interest, forming what is known as the cured group. Identifying such individuals is not always possible beforehand, as they provide only right-censored data. Ignoring the presence of the cured group can introduce bias in the final model. This paper presents a method for estimating a semiparametric additive hazards model that accounts for the cured fraction. Unlike regression coefficients in a hazard ratio model, those in an additive hazard model measure hazard differences. The proposed method uses a primal-dual interior point algorithm to obtain constrained maximum penalized likelihood estimates of the model parameters, including the regression coefficients and the baseline hazard, subject to certain non-negativity constraints.", "primary_category": "stat.ME", "categories": ["stat.ME"], "pdf_url": "https://arxiv.org/pdf/2401.01234v1", "entry_id": "http://arxiv.org/abs/2401.01234v1"}
{"source": "recent_search", "query": "AI trends for 2026 (agentic AI, physical AI)", "paper": {"arxiv_id": "2601.04194v1", "title": "Choreographing a World of Dynamic Objects", "authors": ["Yanzhe Lyu", "Chen Geng", "Karthik Dharmarajan", "Yunzhi Zhang", "Hadi Alzayer", "Shangzhe Wu", "Jiajun Wu"], "published": "2026-01-07T18:59:40+00:00", "updated": "2026-01-07T18:59:40+00:00", "summary": "Dynamic objects in our physical 4D (3D + time) world are constantly evolving, deforming, and interacting with other objects, leading to diverse 4D scene dynamics. In this paper, we present a universal generative pipeline, CHORD, for CHOReographing Dynamic objects and scenes and synthesizing this type of phenomena. Traditional rule-based graphics pipelines to create these dynamics are based on category-specific heuristics, yet are labor-intensive and not scalable. Recent learning-based methods typically demand large-scale datasets, which may not cover all object categories in interest. Our approach instead inherits the universality from the video generative models by proposing a distillation-based pipeline to extract the rich Lagrangian motion information hidden in the Eulerian representations of 2D videos. Our method is universal, versatile, and category-agnostic. We demonstrate its effectiveness by conducting experiments to generate a diverse range of multi-body 4D dynamics, show its advantage compared to existing methods, and demonstrate its applicability in generating robotics manipulation policies. Project page: https://yanzhelyu.github.io/chord", "primary_category": "cs.CV", "categories": ["cs.CV", "cs.GR", "cs.RO"], "pdf_url": "https://arxiv.org/pdf/2601.04194v1", "entry_id": "http://arxiv.org/abs/2601.04194v1"}}
{"source": "recent_search", "query": "AI trends for 2026 (agentic AI, physical AI)", "paper": {"arxiv_id": "2601.04193v1", "title": "A discrete Benamou-Brenier formulation of Optimal Transport on graphs", "authors": ["Kieran Morris", "Oliver Johnson"], "published": "2026-01-07T18:59:07+00:00", "updated": "2026-01-07T18:59:07+00:00", "summary": "We propose a discrete transport equation on graphs which connects distributions on both vertices and edges. We then derive a discrete analogue of the Benamou-Brenier formulation for Wasserstein-$1$ distance on a graph and as a result classify all $W_1$ geodesics on graphs.", "primary_category": "cs.IT", "categories": ["cs.IT", "math.PR", "stat.ML"], "pdf_url": "https://arxiv.org/pdf/2601.04193v1", "entry_id": "http://arxiv.org/abs/2601.04193v1"}}
{"source": "recent_search", "query": "AI trends for 2026 (agentic AI, physical AI)", "paper": {"arxiv_id": "2601.04192v1", "title": "Prediction Intervals for Interim Events in Randomized Clinical Trials with Time-to-Event Endpoints", "authors": ["Edoardo Ratti", "Federico L. Perlino", "Stefania Galimberti", "Maria G. Valsecchi"], "published": "2026-01-07T18:58:45+00:00", "updated": "2026-01-07T18:58:45+00:00", "summary": "Time-to-event endpoints are central to evaluate treatment efficacy across many disease areas. Many trial protocols include interim analyses within group-sequential designs that control type I error via spending functions or boundary methods. The corresponding operating characteristics depend on the number of looks and the information accrued. Planning interim analyses with time-to-event endpoints is challenging because statistical information depends on the number of observed events. Ensuring adequate follow-up to accrue the required events is therefore critical, making interim prediction of information at scheduled looks and at the final analysis essential. While several methods have been developed to predict the calendar time required to reach a target number of events, to the best of our knowledge there is no established framework that addresses the prediction of the number of events at a future date with corresponding prediction intervals. Starting from an prediction interval approach originally developed in reliability engineering for the number of future component failures, we reformulated and extended it to the context of interim monitoring in clinical trials. This adaptation yields a general framework for event-count prediction intervals in the clinical setting, taking the patient as the unit of analysis and accommodating a range of parametric survival models, patient-level covariates, stagged entry and possible dependence between entry dates and lost to follow-up. Prediction intervals are obtained in a frequentist framework from a bootstrap estimator of the conditional distribution of future events. The performance of the proposed approach is investigated via simulation studies and illustrated by analyzing a real-world phase III trial in childhood acute lymphoblastic leukaemia.", "primary_category": "stat.ME", "categories": ["stat.ME"], "pdf_url": "https://arxiv.org/pdf/2601.04192v1", "entry_id": "http://arxiv.org/abs/2601.04192v1"}}
{"source": "recent_search", "query": "AI trends for 2026 (agentic AI, physical AI)", "paper": {"arxiv_id": "2601.04191v1", "title": "Embedding Autonomous Agents in Resource-Constrained Robotic Platforms", "authors": ["Negar Halakou", "Juan F. Gutierrez", "Ye Sun", "Han Jiang", "Xueming Wu", "Yilun Song", "Andres Gomez"], "published": "2026-01-07T18:57:32+00:00", "updated": "2026-01-07T18:57:32+00:00", "summary": "Many embedded devices operate under resource constraints and in dynamic environments, requiring local decision-making capabilities. Enabling devices to make independent decisions in such environments can improve the responsiveness of the system and reduce the dependence on constant external control. In this work, we integrate an autonomous agent, programmed using AgentSpeak, with a small two-wheeled robot that explores a maze using its own decision-making and sensor data. Experimental results show that the agent successfully solved the maze in 59 seconds using 287 reasoning cycles, with decision phases taking less than one millisecond. These results indicate that the reasoning process is efficient enough for real-time execution on resource-constrained hardware. This integration demonstrates how high-level agent-based control can be applied to resource-constrained embedded systems for autonomous operation.", "primary_category": "cs.RO", "categories": ["cs.RO", "cs.AI"], "pdf_url": "https://arxiv.org/pdf/2601.04191v1", "entry_id": "http://arxiv.org/abs/2601.04191v1"}}
{"source": "recent_search", "query": "AI trends for 2026 (agentic AI, physical AI)", "paper": {"arxiv_id": "2601.04190v1", "title": "Solar Panel-based Visible Light Communication for Batteryless Systems", "authors": ["Juan F. Gutierrez", "Nhung Nguyen", "Jesus M. Quintero", "Andres Gomez"], "published": "2026-01-07T18:57:19+00:00", "updated": "2026-01-07T18:57:19+00:00", "summary": "This paper presents a batteryless wireless communication node for the Internet of Things, powered entirely by ambient light and capable of receiving data through visible light communication. A solar panel serves dual functions as an energy harvester and an optical antenna, capturing modulated signals from LED light sources. A lightweight analog front-end filters and digitizes the signals for an 8-bit low-power processor, which manages the system's operational states based on stored energy levels. The main processor is selectively activated to minimize energy consumption. Data reception is synchronized with the harvester's open-circuit phase, reducing interference and improving signal quality. The prototype reliably decodes 32-bit VLC frames at 800\\,Herz, consuming less than 2.8\\,mJ, and maintains sleep-mode power below 30\\,uW.", "primary_category": "eess.SY", "categories": ["eess.SY", "eess.SP"], "pdf_url": "https://arxiv.org/pdf/2601.04190v1", "entry_id": "http://arxiv.org/abs/2601.04190v1"}}
