{"query": "what is quantum computing", "work": {"openalex_id": "https://openalex.org/W4408778024", "openalex_id_short": "W4408778024", "title": "The Role of Smart Grid Technologies in Urban and Sustainable Energy Planning", "authors": ["Mohamed G Moh Almihat", "Josiah L. Munda"], "published": "2025-03-24", "abstract": "Traditional centralized energy grids struggle to meet urban areas’ increasingly complex energy demands, necessitating the development of more sustainable and resilient energy solutions. Smart microgrids offer a decentralized approach that enhances energy efficiency, facilitates the integration of renewable energy sources, and improves urban resilience. This study follows a systematic review approach, analyzing the literature published in peer-reviewed journals, conference proceedings, and industry reports between 2011 and 2025. The research draws from academic publications of energy institutions alongside regulatory reports, examining actual smart microgrid deployments in San Diego, Barcelona, and Seoul. Additionally, this article provides real-world case studies from New York and London, showcasing successful and unsuccessful smart microgrid deployments. The Brooklyn Microgrid in New York demonstrates peer-to-peer energy trading, while London faces regulations and funding challenges in its decentralized energy systems. The paper also explores economic and policy frameworks such as public–private partnerships (PPPs), localized energy markets, and standardized regulatory models to enable microgrid adoption at scale. While PPPs provide financial and infrastructural support for microgrid deployment, they also introduce stakeholder alignment and regulatory compliance complexities. Countries like Germany and India have successfully used PPPs for smart microgrid development, leveraging low-interest loans, government incentives, and regulatory mechanisms to encourage innovation and adoption of smart microgrid technologies. In addition, the review examines new trends like the utilization of AI and quantum computing to optimize energy, peer-to-peer energy trading, and climate resilient design before outlining a future research agenda focused on cybersecurity, decarbonization, and the inclusion of new technology. Contributions include the development of a modular and scalable microgrid framework, innovative hybrid storage systems, and a performance-based policy model suited to the urban environment. These contributions help to fill the gap between what is possible today and what is needed for future sustainable urban energy systems and create the foundation for resilient cities of the next century.", "doi": "https://doi.org/10.3390/en18071618", "journal": "Energies", "cited_by_count": 21, "pdf_url": "https://www.mdpi.com/1996-1073/18/7/1618/pdf?version=1742818962", "pdf_urls": ["https://www.mdpi.com/1996-1073/18/7/1618/pdf?version=1742818962"], "landing_page_url": "https://doi.org/10.3390/en18071618", "is_oa": true, "oa_status": "gold"}}
{"query": "what is quantum computing", "work": {"openalex_id": "https://openalex.org/W4413877234", "openalex_id_short": "W4413877234", "title": "Cryptography &amp; Quantum Computing: Why it matters and what comes next?", "authors": ["K. G. Mohan"], "published": "2025-09-01", "abstract": "In today’s digital world, most of our personal, financial, and health data is stored online. This makes cybersecurity extremely important — but also more challenging. Recent cyberattacks like the one on Australia’s MediSecure show how weak security can lead to huge losses. Now, a new risk is emerging: quantum computers. These work very differently from classical computers and can break the encryption methods (like RSA and AES) that we currently use to protect online data. This paper explains how cryptography works, what types exist (symmetric and asymmetric), and why current systems may not survive in a world where quantum computers are common. It introduces powerful quantum algorithms like Shor’s and Grover’s, which can break RSA and weaken AES much faster using quantum computers than any normal computers. This shows the power of quantum computers. These developments have pushed scientists to create new encryption systems called Post-Quantum Cryptography (PQC), which are built to resist quantum attacks but still run on regular devices. The paper also explores how quantum computing is evolving — from early research in the 1980s to real working processors today — and how countries and companies are investing in this technology. It suggests that in the future, people may access quantum computers over the cloud, rather than owning them. Finally, this research shows that the rise of quantum computing is both a threat and an opportunity. It challenges us to update our security systems, but it also opens the door for new startups and careers in quantum-safe cybersecurity.", "doi": "https://doi.org/10.70121/001c.143824", "journal": "Scholarly review .", "cited_by_count": 0, "pdf_url": "https://www.scholarlyreview.org/article/143824.pdf", "pdf_urls": ["https://www.scholarlyreview.org/article/143824.pdf"], "landing_page_url": "https://doi.org/10.70121/001c.143824", "is_oa": true, "oa_status": "hybrid", "downloaded_pdf_url": "https://www.scholarlyreview.org/article/143824.pdf"}}
{"query": "what is quantum computing", "work": {"openalex_id": "https://openalex.org/W4409149714", "openalex_id_short": "W4409149714", "title": "Nonlocality in photonic materials and metamaterials: roadmap", "authors": ["Francesco Monticone", "Asger Mortensen", "Antonio I. Fernández‐Domínguez", "Yu Luo", "Christos Tserkezis", "Jacob B. Khurgin", "Tigran V. Shahbazyan", "A. J. Chaves", "N. M. R. Peres", "G Wegner", "Kurt Busch", "Huatian Hu", "Fabio Della Sala", "Pu Zhang", "Cristian Ciracì", "Javier Aizpurua", "Antton Babaze", "A. G. Borisov", "Xuewen Chen", "Thomas Christensen", "Wei‐Bin Yan", "Yi Yang", "Ulrich Hohenester", "Lorenz Huber", "Martijn Wubs", "Simone De Liberato", "P. André D. Gonçalves", "F. Javier Garcı́a de Abajo", "Ortwin Hess", "Illya Tarasenko", "Joel D. Cox", "Line Jelver", "Eduardo J. C. Dias", "M Sanchez", "Dionisios Margetis", "G. Gómez-Santos", "Tobias Stauber", "Sergei Tretyakov", "Constantin Simovski", "Samaneh Pakniyat", "J. S. Gómez‐Díaz", "Igor V. Bondarev", "Svend‐Age Biehs", "Alexandra Boltasseva", "Vladimir M. Shalaev", "Alexey V. Krasavin", "Anatoly V. Zayats", "Andrea Alù", "Jung‐Hwan Song", "Mark L. Brongersma", "Uriel Levy", "Olivia Y. Long", "Cheng Guo", "Shanhui Fan", "Sergey I. Bozhevolnyi", "Adam Overvig", "F. R. Prudêncio", "Mário G. Silveirinha", "S. Ali Hassani Gangaraj", "Christos Argyropoulos", "Paloma A. Huidobro", "Emanuele Galiffi", "Fan Yang", "J. B. Pendry", "David A. B. Miller", "Xuezhi Zheng", "David A. B. Miller"], "published": "2025-04-05", "abstract": "Photonic technologies continue to drive the quest for new optical materials with unprecedented responses. A major frontier in this field is the exploration of nonlocal (spatially dispersive) materials, going beyond the local, wavevector-independent assumption traditionally adopted in optical material modeling. The growing interest in plasmonic, polaritonic, and quantum materials has revealed naturally occurring nonlocalities, emphasizing the need for more accurate models to predict and design their optical responses. This has major implications also for topological, nonreciprocal, and time-varying systems based on these material platforms. Beyond natural materials, artificially structured materials—metamaterials and metasurfaces—can provide even stronger and engineered nonlocal effects, emerging from long-range interactions or multipolar effects. This is a rapidly expanding area in the field of photonic metamaterials, with open frontiers yet to be explored. In metasurfaces, in particular, nonlocality engineering has emerged as a powerful tool for designing strongly wavevector-dependent responses, enabling enhanced wavefront control, spatial compression, multifunctional devices, and wave-based computing. Furthermore, nonlocality and related concepts play a critical role in defining the ultimate limits of what is possible in optics, photonics, and wave physics. This Roadmap aims to survey the most exciting developments in nonlocal photonic materials and metamaterials, highlight new opportunities and open challenges, and chart new pathways that will drive this emerging field forward—toward new scientific discoveries and technological advancements.", "doi": "https://doi.org/10.1364/ome.559374", "journal": "Optical Materials Express", "cited_by_count": 15, "pdf_url": null, "pdf_urls": ["https://arxiv.org/pdf/2503.00519"], "landing_page_url": "https://doi.org/10.1364/ome.559374", "is_oa": true, "oa_status": "gold", "downloaded_pdf_url": "https://arxiv.org/pdf/2503.00519"}}
{"query": "what is quantum computing", "work": {"openalex_id": "https://openalex.org/W4407877069", "openalex_id_short": "W4407877069", "title": "Anderson impurity solver integrating tensor network methods with quantum computing", "authors": ["François Jamet", "Lachlan P. Lindoy", "Yannic Rath", "Connor Lenihan", "Abhishek Agarwal", "Enrico Fontana", "Fedor Šimkovic", "Baptiste Anselme Martin", "Ivan Rungger"], "published": "2025-02-24", "abstract": "Solving the Anderson impurity model typically involves a two-step process, where one first calculates the ground state of the Hamiltonian and then computes its dynamical properties to obtain Green’s function. Here, we propose a hybrid classical/quantum algorithm where the first step is performed using a classical computer to obtain the tensor network ground state as well as its quantum circuit representation and the second step is executed on the quantum computer to obtain Green’s function. Our algorithm exploits the efficiency of tensor networks for preparing ground states on classical computers and takes advantage of quantum processors for the evaluation of the time evolution, which can become intractable on classical computers. We demonstrate the algorithm using 24 qubits on a quantum computing emulator for SrVO3 with a multi-orbital Anderson impurity model within the dynamical mean field theory. The tensor network based ground state quantum circuit preparation algorithm can also be performed for up to 60 qubits with our available computing resources, while the state vector emulation of the quantum algorithm for time evolution is beyond what is accessible with such resources. We show that, provided that the tensor network calculation is able to accurately obtain the ground state energy, this scheme does not require a perfect reproduction of the ground state wave function on the quantum circuit to give an accurate Green’s function. This hybrid approach may lead to quantum advantage in materials simulations where the ground state can be computed classically, but where the dynamical properties cannot.", "doi": "https://doi.org/10.1063/5.0245488", "journal": "APL Quantum", "cited_by_count": 3, "pdf_url": null, "pdf_urls": [], "landing_page_url": "https://doi.org/10.1063/5.0245488", "is_oa": true, "oa_status": "diamond"}}
{"query": "what is quantum computing", "work": {"openalex_id": "https://openalex.org/W7116737831", "openalex_id_short": "W7116737831", "title": "Quantum Leap: A Look at Google’s and China’s Quantum Computing Efforts and What They Mean for the Future of the Industry", "authors": ["Bhuvaneswari R", "Benjamin Luíz Franklin", "Mercy Anthony"], "published": "2025-12-01", "abstract": "Quantum computing is evolving as a revolutionary technology, capable of solving complex problems that are far beyond the reach of traditional computers. Google and China as the global leaders in the race taking their distinct paths with their research and development strategies. Through the Sycamore quantum processor and its Gemini AI, Google focuses on taking the artificial intelligence to the next level, improving optimization, and building practical tools for commercial use. From the Google’s work, especially with the Sycamore quantum processor and its Gemini AI ecosystem, it focuses on advancing artificial intelligence, improving optimization, and building practical tools for commercial use. In contrast, China’s progress, demonstrated through systems like the Jiuzhang photonic platform and the superconducting Zuchongzhi processor, is closely tied to national objectives such as cybersecurity, secure communication, and long-term strategic advantage. This literature review studies the recent researches to compare the two approaches to understand their motivations and examine how their innovations are influencing the future of computing. It also points out existing limitations, challenges in scaling hardware and integrating quantum computing with AI systems. Finally, it emphasizes the key areas where further researches are needed to sustain progress and unleash the full potential of quantum technologies.", "doi": "https://doi.org/10.55524/ijircst.2025.13.6.8", "journal": "International Journal of Innovative Research in Computer Science & Technology", "cited_by_count": 0, "pdf_url": "https://ijircst.org/DOC/1417_pdf.pdf", "pdf_urls": ["https://ijircst.org/DOC/1417_pdf.pdf"], "landing_page_url": "https://doi.org/10.55524/ijircst.2025.13.6.8", "is_oa": true, "oa_status": "diamond", "downloaded_pdf_url": "https://ijircst.org/DOC/1417_pdf.pdf"}}
{"query": "what is quantum computing", "work": {"openalex_id": "https://openalex.org/W4413456300", "openalex_id_short": "W4413456300", "title": "Editorial: Beyond the hype: What quantum computing means for organizational cybersecurity", "authors": ["Sanjay Goel", "Gurvirender Tejay"], "published": "2025-08-15", "abstract": null, "doi": "https://doi.org/10.1108/ocj-03-2025-038", "journal": "Organizational Cybersecurity Journal Practice Process and People", "cited_by_count": 0, "pdf_url": null, "pdf_urls": [], "landing_page_url": "https://doi.org/10.1108/ocj-03-2025-038", "is_oa": true, "oa_status": "diamond"}}
{"query": "what is quantum computing", "work": {"openalex_id": "https://openalex.org/W4407520084", "openalex_id_short": "W4407520084", "title": "Dynamical heterogeneity and large deviations in the open quantum East glass model from tensor networks", "authors": ["Luke Causer", "Mari Carmen Bañuls", "Juan P. Garrahan"], "published": "2025-02-13", "abstract": "We study the nonequilibrium dynamics of the dissipative quantum East model via numerical tensor networks. We use matrix product states to represent evolution under quantum-jump unravellings for sizes beyond those accessible to exact diagonalization. This allows us to demonstrate that dynamical heterogeneity accompanies slow relaxation, in analogy with what is seen in classical glassy systems. Furthermore, using variational matrix product operators we (i) compute the spectral gap of the Lindbladian and show that glassiness is enhanced in the presence of weak quantum fluctuations compared to the pure classical case, and (ii) obtain the dynamical large deviations by calculating the leading eigenvector of the tilted Lindbladian and find clear evidence for a first-order active-inactive dynamical phase transition. We also show how to directly sample the rare quantum trajectories associated to the large deviations.", "doi": "https://doi.org/10.1103/physrevb.111.l060303", "journal": "Physical review. B./Physical review. B", "cited_by_count": 3, "pdf_url": null, "pdf_urls": [], "landing_page_url": "https://doi.org/10.1103/physrevb.111.l060303", "is_oa": true, "oa_status": "hybrid"}}
{"query": "what is quantum computing", "work": {"openalex_id": "https://openalex.org/W4391590997", "openalex_id_short": "W4391590997", "title": "Full Characterization of the Depth Overhead for Quantum Circuit Compilation with Arbitrary Qubit Connectivity Constraint", "authors": ["Pei Yuan", "Shengyu Zhang"], "published": "2025-05-28", "abstract": "In some physical implementations of quantum computers, 2-qubit operations can be applied only on certain pairs of qubits. Compilation of a quantum circuit into one compliant to such qubit connectivity constraint results in an increase of circuit depth. Various compilation algorithms were studied, yet what this depth overhead is remains elusive. In this paper, we fully characterize the depth overhead by the routing number of the underlying constraint graph, a graph-theoretic measure which has been studied for 3 decades. We also give reduction algorithms between different graphs, which allow compilation for one graph to be transferred to one for another. These results, when combined with existing routing algorithms, give asymptotically optimal compilation for all commonly seen connectivity graphs in quantum computing.", "doi": "https://doi.org/10.22331/q-2025-05-28-1757", "journal": "Quantum", "cited_by_count": 2, "pdf_url": "https://quantum-journal.org/papers/q-2025-05-28-1757/pdf/", "pdf_urls": ["https://quantum-journal.org/papers/q-2025-05-28-1757/pdf/", "https://arxiv.org/pdf/2402.02403"], "landing_page_url": "https://doi.org/10.22331/q-2025-05-28-1757", "is_oa": true, "oa_status": "gold", "downloaded_pdf_url": "https://quantum-journal.org/papers/q-2025-05-28-1757/pdf/"}}
