{"arxiv_id": "2401.01234v1", "title": "Mixture cure semiparametric additive hazard models under partly interval censoring -- a penalized likelihood approach", "authors": ["Jinqing Li", "Jun Ma"], "published": "2024-01-02T15:02:42+00:00", "updated": "2024-01-02T15:02:42+00:00", "summary": "Survival analysis can sometimes involve individuals who will not experience the event of interest, forming what is known as the cured group. Identifying such individuals is not always possible beforehand, as they provide only right-censored data. Ignoring the presence of the cured group can introduce bias in the final model. This paper presents a method for estimating a semiparametric additive hazards model that accounts for the cured fraction. Unlike regression coefficients in a hazard ratio model, those in an additive hazard model measure hazard differences. The proposed method uses a primal-dual interior point algorithm to obtain constrained maximum penalized likelihood estimates of the model parameters, including the regression coefficients and the baseline hazard, subject to certain non-negativity constraints.", "primary_category": "stat.ME", "categories": ["stat.ME"], "pdf_url": "https://arxiv.org/pdf/2401.01234v1", "entry_id": "http://arxiv.org/abs/2401.01234v1"}
{"arxiv_id": "2311.12345v1", "title": "Stable Diffusion For Aerial Object Detection", "authors": ["Yanan Jian", "Fuxun Yu", "Simranjit Singh", "Dimitrios Stamoulis"], "published": "2023-11-21T04:38:21+00:00", "updated": "2023-11-21T04:38:21+00:00", "summary": "Aerial object detection is a challenging task, in which one major obstacle lies in the limitations of large-scale data collection and the long-tail distribution of certain classes. Synthetic data offers a promising solution, especially with recent advances in diffusion-based methods like stable diffusion (SD). However, the direct application of diffusion methods to aerial domains poses unique challenges: stable diffusion's optimization for rich ground-level semantics doesn't align with the sparse nature of aerial objects, and the extraction of post-synthesis object coordinates remains problematic. To address these challenges, we introduce a synthetic data augmentation framework tailored for aerial images. It encompasses sparse-to-dense region of interest (ROI) extraction to bridge the semantic gap, fine-tuning the diffusion model with low-rank adaptation (LORA) to circumvent exhaustive retraining, and finally, a Copy-Paste method to compose synthesized objects with backgrounds, providing a nuanced approach to aerial object detection through synthetic data.", "primary_category": "cs.CV", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf_url": "https://arxiv.org/pdf/2311.12345v1", "entry_id": "http://arxiv.org/abs/2311.12345v1"}
{"source": "recent_search", "query": "quantum machine learning industry applications overview", "paper": {"arxiv_id": "2601.04194v1", "title": "Choreographing a World of Dynamic Objects", "authors": ["Yanzhe Lyu", "Chen Geng", "Karthik Dharmarajan", "Yunzhi Zhang", "Hadi Alzayer", "Shangzhe Wu", "Jiajun Wu"], "published": "2026-01-07T18:59:40+00:00", "updated": "2026-01-07T18:59:40+00:00", "summary": "Dynamic objects in our physical 4D (3D + time) world are constantly evolving, deforming, and interacting with other objects, leading to diverse 4D scene dynamics. In this paper, we present a universal generative pipeline, CHORD, for CHOReographing Dynamic objects and scenes and synthesizing this type of phenomena. Traditional rule-based graphics pipelines to create these dynamics are based on category-specific heuristics, yet are labor-intensive and not scalable. Recent learning-based methods typically demand large-scale datasets, which may not cover all object categories in interest. Our approach instead inherits the universality from the video generative models by proposing a distillation-based pipeline to extract the rich Lagrangian motion information hidden in the Eulerian representations of 2D videos. Our method is universal, versatile, and category-agnostic. We demonstrate its effectiveness by conducting experiments to generate a diverse range of multi-body 4D dynamics, show its advantage compared to existing methods, and demonstrate its applicability in generating robotics manipulation policies. Project page: https://yanzhelyu.github.io/chord", "primary_category": "cs.CV", "categories": ["cs.CV", "cs.GR", "cs.RO"], "pdf_url": "https://arxiv.org/pdf/2601.04194v1", "entry_id": "http://arxiv.org/abs/2601.04194v1"}}
{"source": "recent_search", "query": "quantum machine learning industry applications overview", "paper": {"arxiv_id": "2601.04193v1", "title": "A discrete Benamou-Brenier formulation of Optimal Transport on graphs", "authors": ["Kieran Morris", "Oliver Johnson"], "published": "2026-01-07T18:59:07+00:00", "updated": "2026-01-07T18:59:07+00:00", "summary": "We propose a discrete transport equation on graphs which connects distributions on both vertices and edges. We then derive a discrete analogue of the Benamou-Brenier formulation for Wasserstein-$1$ distance on a graph and as a result classify all $W_1$ geodesics on graphs.", "primary_category": "cs.IT", "categories": ["cs.IT", "math.PR", "stat.ML"], "pdf_url": "https://arxiv.org/pdf/2601.04193v1", "entry_id": "http://arxiv.org/abs/2601.04193v1"}}
{"source": "recent_search", "query": "quantum machine learning industry applications overview", "paper": {"arxiv_id": "2601.04187v1", "title": "On the Strong Unital Property for the Affine VOAs", "authors": ["Angela Cai"], "published": "2026-01-07T18:55:50+00:00", "updated": "2026-01-07T18:55:50+00:00", "summary": "Representations of vertex operator algebras $V$ (VOAs) have numerous applications, including the construction of sheaves of conformal blocks on moduli spaces of curves. For a $V$-module $W = \\oplus W_d$, a sequence of associative algebras $\\mathfrak{A}_d$ acts on each graded component $W_d$. When these $d$th-mode transition algebras $\\mathfrak{A}_d$ are strongly unital - meaning they are unital with units acting as the identity on $W_d$ - the associated sheaves of conformal blocks are vector bundles rather than merely coherent sheaves. This strong unital property, while difficult to verify in practice, has other important implications as well. Here we construct explicit strong units for $L_{\\widehat{\\mathfrak{sl}_2}}(1,0)$, the simple affine VOA for $\\mathfrak{sl}_2$ at level $1$, and establish that mode transition algebras for universal affine VOAs for $\\mathfrak{sl}_2$ are never strongly unital at any level $k$ not equal to the critical level $-2$.", "primary_category": "math.QA", "categories": ["math.QA", "math.RT"], "pdf_url": "https://arxiv.org/pdf/2601.04187v1", "entry_id": "http://arxiv.org/abs/2601.04187v1"}}
{"source": "recent_search", "query": "quantum machine learning industry applications overview", "paper": {"arxiv_id": "2601.04186v1", "title": "A Comprehensive Computational Framework for Materials Design, Ab Initio Modeling, and Molecular Docking", "authors": ["Md Rakibul Karim Akanda", "Michael P. Richard"], "published": "2026-01-07T18:53:37+00:00", "updated": "2026-01-07T18:53:37+00:00", "summary": "To facilitate rational molecular and materials design, this research proposes an integrated computational framework that combines stochastic simulation, ab initio quantum chemistry, and molecular docking. The suggested workflow allows systematic investigation of structural stability, binding affinity, and electronic properties across biological and materials science domains by utilizing complementary tools like Avogadro for molecular construction and visualization, AutoDock for docking and interaction analysis, and ORCA for high-level electronic structure computations. Uncertainty, configurational sampling, and optimization in high-dimensional chemical spaces are addressed by combining Monte Carlo-based and annealing-inspired techniques. The work shows how materials science ideas such as polymer design, thin films, crystalline lattices, and bioelectronic systems can be applied to drug development. On-device, open-source computational methods are viable, scalable, and economical, as demonstrated by comparative platform analysis. All things considered, the findings highlight the need of an integrated, repeatable computational pipeline for speeding up de novo molecule assembly and materials architecture while lowering experimental risk and expense.", "primary_category": "cond-mat.mtrl-sci", "categories": ["cond-mat.mtrl-sci", "physics.chem-ph"], "pdf_url": "https://arxiv.org/pdf/2601.04186v1", "entry_id": "http://arxiv.org/abs/2601.04186v1"}}
{"source": "recent_search", "query": "quantum machine learning industry applications overview", "paper": {"arxiv_id": "2601.04184v1", "title": "Transforming Video Subjective Testing with Training, Engagement, and Real-Time Feedback", "authors": ["Kumar Rahul", "Sriram Sethuraman", "Andrew Segall", "Yixu Chen"], "published": "2026-01-07T18:51:23+00:00", "updated": "2026-01-07T18:51:23+00:00", "summary": "Subjective video quality assessment is crucial for optimizing streaming and compression, yet traditional protocols face limitations in capturing nuanced perceptual differences and ensuring reliable user input. We propose an integrated framework that enhances rater training, enforces attention through real-time scoring, and streamlines pairwise comparisons to recover quality scores with fewer comparisons. Participants first undergo an automated training quiz to learn key video quality indicators (e.g., compression artifacts) and verify their readiness. During the test, a real-time attention scoring mechanism, using \"golden\" video pairs, monitors and reinforces rater focus by applying penalties for lapses. An efficient chain-based pairwise comparison procedure is then employed, yielding quality scores in Just-Objectionable-Differences (JOD) units. Experiments comparing three groups (no training, training without feedback, and training with feedback) with 80 participants demonstrate that training-quiz significantly improves data quality in terms of golden unit accuracy and reduces tie rate, while real-time feedback further improves data quality and yields the most monotonic quality ratings. The new training, quiz, testing with feedback, 3-phase approach can significantly reduce the non-monotonic cases on the high quality part of the R-Q curve where normal viewer typically prefer the slightly compressed less-grainy content and help train a better objective video quality metric.", "primary_category": "cs.MM", "categories": ["cs.MM"], "pdf_url": "https://arxiv.org/pdf/2601.04184v1", "entry_id": "http://arxiv.org/abs/2601.04184v1"}}
