{"arxiv_id": "2511.00922v1", "title": "Validation of Semi-Empirical xTB Methods for High-Throughput Screening of TADF Emitters: A 747-Molecule Benchmark Study", "authors": ["Jean-Pierre Tchapet Njafa", "Elvira Vanelle Kameni Tcheuffa", "Aissatou Maghame", "Serge Guy Nana Engo"], "published": "2025-11-02T12:48:54+00:00", "updated": "2025-11-02T12:48:54+00:00", "summary": "Thermally activated delayed fluorescence (TADF) emitters are essential for next-generation, high-efficiency organic light-emitting diodes (OLEDs), yet their rational design is hampered by the high computational cost of accurate excited-state predictions. Here, we present a comprehensive benchmark study validating semi-empirical extended tight-binding (xTB) methods -- specifically sTDA-xTB and sTD-DFT-xTB -- for the high-throughput screening of TADF materials. Using an unprecedentedly large dataset of \\num{747} experimentally characterized emitters, our framework demonstrates a computational cost reduction of over \\qty{99}{\\percent} compared to conventional TD-DFT, while maintaining strong internal consistency between methods (Pearson $r \\approx \\num{0.82}$ for \\deltaest), validating their utility for relative molecular ranking. Validation against \\num{312} experimental \\deltaest values reveals a mean absolute error of approximately \\qty{0.17}{\\electronvolt}, a discrepancy attributed to the vertical approximation inherent to the HTS protocol, underscoring the methods' role in screening rather than quantitative prediction. Through large-scale data analysis, we statistically validate key design principles, confirming the superior performance of Donor-Acceptor-Donor (D-A-D) architectures and identifying an optimal D-A torsional angle range of \\qtyrange{50}{90}{\\degree} for efficient TADF. Principal Component Analysis reveals that the complex property space is fundamentally low-dimensional, with three components capturing nearly \\qty{90}{\\percent} of the variance. This work establishes these semi-empirical methods as powerful, cost-effective tools for accelerating TADF discovery and provides a robust set of data-driven design rules and methodological guidelines for the computational materials science community.", "primary_category": "cond-mat.mtrl-sci", "categories": ["cond-mat.mtrl-sci"], "doi": null, "pdf_url": "https://arxiv.org/pdf/2511.00922v1", "entry_id": "http://arxiv.org/abs/2511.00922v1"}
{"arxiv_id": "2512.06029v1", "title": "From orbital analysis to active learning: an integrated strategy for the accelerated design of TADF emitters", "authors": ["Jean-Pierre Tchapet Njafa", "Steve Cabrel Teguia Kouam", "Patrick Mvoto Kongo", "Serge Guy Nana Engo"], "published": "2025-12-04T15:10:04+00:00", "updated": "2025-12-04T15:10:04+00:00", "summary": "Thermally Activated Delayed Fluorescence (TADF) emitters must satisfy two competing requirements: small singlet-triplet energy gaps for thermal upconversion and sufficient spin-orbit coupling for fast reverse intersystem crossing. Predicting these properties accurately demands expensive calculations. We address this using a validated semi-empirical protocol (GFN2-xTB geometries, sTDA/sTD-DFT-xTB excited states) on 747 molecules, combined with charge-transfer descriptors from Natural Transition Orbital analysis. The hole-electron spatial overlap She emerges as a key predictor, accounting for 21% of feature importance for the triplet state alone. Our best model (Support Vector Regression) reaches MAE = 0.024 eV and R2 = 0.96 for $ΔE_{ST}$. Active learning reduces the data needed to reach target accuracy by approximately 25% compared to random sampling. Three application domains are explored: NIR-emitting probes for bioimaging, photocatalytic sensitizers, and fast-response materials for photodetection.", "primary_category": "cond-mat.mtrl-sci", "categories": ["cond-mat.mtrl-sci", "physics.chem-ph"], "doi": null, "pdf_url": "https://arxiv.org/pdf/2512.06029v1", "entry_id": "http://arxiv.org/abs/2512.06029v1"}
{"arxiv_id": "1901.01201v1", "title": "General Approach To Compute Phosphorescent OLED Efficiency", "authors": ["Xu Zhang", "Denis Jacquemin", "Qian Peng", "Zhigang Shuai", "Daniel Escudero"], "published": "2019-01-04T16:37:25+00:00", "updated": "2019-01-04T16:37:25+00:00", "summary": "Phosphorescent organic light-emitting diodes (PhOLEDs) are widely used in the display industry. In PhOLEDs, cyclometalated Ir(III) complexes are the most widespread triplet emitter dopants to attain red, e.g., Ir(piq)3 (piq = 1-phenylisoquinoline), and green, e.g., Ir(ppy)3 (ppy = 2-phenylpyridine), emissions, whereas obtaining operative deep-blue emitters is still one of the major challenges. When designing new emitters, two main characteristics besides colors should be targeted: high photostability and large photoluminescence efficiencies. To date, these are very often optimized experimentally in a trial-and-error manner. Instead, accurate predictive tools would be highly desirable. In this contribution, we present a general approach for computing the photoluminescence lifetimes and efficiencies of Ir(III) complexes by considering all possible competing excited-state deactivation processes and importantly explicitly including the strongly temperature-dependent ones. This approach is based on the combination of state-of-the-art quantum chemical calculations and excited-state decay rate formalism with kinetic modeling, which is shown to be an efficient and reliable approach for a broad palette of Ir(III) complexes, i.e., from yellow/orange to deep-blue emitters.", "primary_category": "physics.chem-ph", "categories": ["physics.chem-ph"], "doi": "10.1021/acs.jpcc.8b00831", "pdf_url": "https://arxiv.org/pdf/1901.01201v1", "entry_id": "http://arxiv.org/abs/1901.01201v1", "cited_by_count": 88}
